# task1

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Отсровский']}, 
                      columns = ['author_id', 'author_name'])

In [3]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Отсровский

In [4]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                    'price': [450, 300, 350, 500, 450, 370, 290]},
                   columns = ['author_id', 'book_title', 'price'])

In [5]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

# task2

In [6]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')

In [7]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Отсровский                 Гроза    370
6          3  Отсровский  Таланты и поклонники    290

# task3

In [8]:
top5 = authors_price.sort_values(by='price', ascending=False).head(5)

In [9]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Отсровский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

# task4

In [10]:
authors_stat_min = authors_price.groupby("author_name").agg({"price": "min"}).rename(columns = {"price": "min_price"})

In [11]:
authors_stat_max = authors_price.groupby("author_name").agg({"price": "max"}).rename(columns = {"price": "max_price"})

In [12]:
authors_stat_mean = authors_price.groupby("author_name").agg({"price": "mean"}).rename(columns = {"price": "mean_price"})

In [13]:
authors_stat = pd.merge(authors_stat_min, authors_stat_max, on = 'author_name', how = 'inner').merge(authors_stat_mean, on = 'author_name', how = 'inner')

In [14]:
authors_stat

             min_price  max_price  mean_price
author_name
Отсровский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000